{
  "model": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_1",
            "trainable": true,
            "batch_input_shape": [null, 224, 224, 3],
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "valid",
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
            "bias_initializer": {"class_name": "Zeros", "config": {}}
          }
        },
        // Additional layers...
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "units": 1,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
            "bias_initializer": {"class_name": "Zeros", "config": {}}
          }
        }
      ]
    }
  },
  "training_config": {
    "optimizer": {
      "class_name": "Adam",
      "config": {
        "name": "Adam",
        "learning_rate": 0.001,
        "beta_1": 0.9,
        "beta_2": 0.999,
        "epsilon": 1e-07,
        "amsgrad": false
      }
    },
    "loss": "binary_crossentropy",
    "metrics": ["accuracy"]
  },
  "keras_version": "2.12.0",
  "backend": "tensorflow"
}
